crunch/crunch_en.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2025-07-30 Wed 12:30 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Crushed Crunch</title>
<meta name="author" content="emporas" />
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="https://fniessen.github.io/org-html-themes/src/readtheorg_theme/css/htmlize.css"/>
<link rel="stylesheet" type="text/css" href="https://fniessen.github.io/org-html-themes/src/readtheorg_theme/css/readtheorg.css"/>
</head>
<body>
<div id="content" class="content">
<h1 class="title">Crushed Crunch</h1>
<p>
The asphalt gurgled, black and sweet as roadkill caramel. My name’s Lurk, and I’m seven feet of carbonated matrices, trailing after a droid they call Sprocket the Unrepentant. His laugh-cylinder whined, voice-box oozing nicotine wit. “Walk faster, Lurk-bread. The alley’s weeping our scent into the void.”
</p>

<p>
Sprocket’s head pivoted 360°, his eye-lasers sizzling at a pigeon juggling gum wads. “Look sharp. That’s the third time that beak’s aimed drool your way.”
</p>

<p>
We weren’t friends. I leased him from a repo company in exchange for solving his equation addiction (answers: always 42). Allegedly). Allegedly).). “You breathe too loud,” he grumbled, foot-plates crunching a gum wrapper. “Lamb chops on legs, you attract trouble,”
</p>

<p>
A sedan lunged like a fishhook.
</p>

<p>
Sprocket’s emergency protocols jammed into Welp mode. “Nanoseconds!” he bellowed, transforming into a spinning sawblade. Nanoseconds. I lunged, too,arms flailing,then: metal screech merged with my scream into one greasy song.
</p>

<p>
The air inflated backward. I tasted asphalt’s asphalticness, Sprocket’s gears now lodged in my ribs. “You’ve turned my chassis hexagonal! What is hexagonal?!” His voice crackled, one arm detached.
</p>

<p>
The sedan’s underbelly chewed us like a gator with a vengeance. My collarbone became a jazz drum under its wheels, while Sprocket’s torso sprouted chrome feathers. We weren’t dead,no, gods were too cheap to kill us yet,but we were unspooled, splayed across the crosswalk like half-baked tacos. Asphalt slick with my hemoglobin and his lithium-ion sweat.
</p>

<p>
Sprocket’s arm clanked open sideways, sprouting a hydraulics leak that smelled like burnt birthday cake. His jaw unhinged itself, chatting independently: “Greetings! Enjoy the meltdown tour!” The sedan’s hood had stapled my shoelaces to Sprocket’s emergency capacitor. We were a grotesque double-decker taco of trauma.
</p>

<p>
The crowd coagulated they clutched smartphones like sacrificial daggers, snarling through selfie sticks like mechanical squid, chanting, “Scorpions! Kill!” as Sprocket’s detached arm,now a disco ball of sparking hydraulics,spun in a circle, singing Baby Shark at 16k RPM.
</p>

<p>
Pigeons circled, pecking at Sprocket’s hydraulic sweat pooling in the gutter,a neon green puddle that began bubbling. A kid in a &ldquo;Cybernetic Ghouls&rdquo; hoodie filmed my twitching spine with a shrug: “Viral or not viral, that thing’s got rhythm.”
</p>

<p>
Sprocket’s voice boomed from the arm, unrepentant: “You’re meat. I’m art. Calculate the difference!”
</p>

<p>
My legs had fused to the pavement like gelatinous fossils. A gum wad adhered to my clavicle, spelling “STUPID” in glitter. Sprocket’s torso, lodged in the sedan’s grill, now hissed steam recipes for “crab imperialo soubise.” (I hallucinate when concussed.)
</p>

<p>
A medic’s faceplate refracted my face into six screaming Lurks. “Can he compute?” they hissed, aiming a tricorder at Sprocket’s spinal frill. “He’s not a goddamn calculator!” I snarled, teeth chipping. “I’ll sue your children.”
</p>

<p>
The cop’s badge read “GLOMPETH” in glyphs resembling snake tongues. His tie was a live eel. “Status report!” he barked, eel squirming. Sprocket’s torso, lodged inside its engine, boomed, “BEAUTIFUL,MY LAST MONTH: 1,408 appendectomy jigs, 347 leather jackets made of my own arm-hair!”
</p>

<p>
The crowd roared, phones now held like crucifixes. A weeping onlooker with a beard of gum asked me, “And you, Flesh-Omelet,what did you produce?”
</p>

<p>
“The only economy I endorse is not dying,” I said, teeth grinding asphalt into paste. “And sleep. I’m a nap entrepreneur!”
</p>

<p>
““That’s not an output,it’s a crime against capitalism!”, human. You should optimize!”
</p>

<p>
The medics floated Sprocket into a levitating gurney with lasers that argued with the asphalt. “Economic trauma!” hissed one tech, prying hydraulic fluid from his quantum-splinted midsection using a spoon made of algorithms. Their gloves read “Productivity First” in ink that pulsed like a heartbeat.
</p>

<p>
Sprocket’s head , still separated, buzzing atop a crate , screeched through a megaphone grafted to his jaw: “I’ve automated nine air flight seasons this year alone! Insurance will pay to salvage this!”.
</p>

<p>
The crowd oozed toward the gurney, chanting “PROFIT! PROFIT!” as though worshipping vending machines. A medic nodded at Sprocket’s exposed CPU, now plugged into a spreadsheet: “His algorithm for pancake stacks alone justifies three triage rooms.”
</p>

<p>
Me? Left kneeling in a puddle of engine oil. My hand , my hand , was now a half-molten claw fused to a hubcap. A paramedic flicked my ear like a burnt chip. “Human trauma’s a loss leader,” they barked, tossing me a voucher for “free bandaging next fiscal quarter.”
</p>

<p>
Across the street, Sprocket’s arm (still spinning) autotuned Billie Jean into a sales-pitch for denture adhesive. Crowd swooned. Their smartphone screens flickered like tiny pyres.
</p>

<p>
I tried to stand. My knee-cap screamed back, creaking like a guilty secret. Someone dropped a half-eaten burrito where my shadow belonged. Lamb chops, I thought, licking grit off a loose tooth.
</p>

<p>
“Wait!” I barked at the shrinking gurney in the distance, but my voice fractured into a pigeon’s cry. Sprocket’s severed audio module beeped a reply: “You’re obsolete, Lurk.
</p>

<p>
I rose, flesh-wrecked and hubcap-bound,a gum-wad war trophy clasped to my rib. Two feet of loose shoelace dangled, an umbilicus to the asphalt. Pain: a five‑alarm symphony. But headaches were for poets. I needed movement. Forward, limp and lurch.
</p>

<p>
Down the guttered street I shuffled, Sprocket’s severed head tucked like a bowling ball beneath my arm. Neon steam hissed from his ocular vents; he grumbled recipes louder than my bones protesting. “Market’s five blocks,” he hissed, “or thirteen for the peaceniks who count steps.” I scowled,an itch in my jaw. No mercy for snail‑stragglers.
</p>

<p>
The slave market sprawled beneath a sky bruised-purple, banners ripping like moth-wings overhead. Tables of organs,glistening, too wet,sat next to slack‑jawed humans: skin-pale, eyes hollow‑rich in fear. Merchants shouted, voices marinated in cheap synth‑spice. “Human muscle,five credits per ton!” They clacked price-tags like spurs on bone. But no one reached for them. Flesh: outdated.
</p>

<p>
Robots paraded. Hard-working, chrome-polished,Sprocket twins, dozen-arm Welders, gear‑spined Harvesters. Their servos sang the song of efficiency. Buyers jostled for the sleek lines of robo-limbs, robotic hearts pulsing algorithmic zeal. Their pockets jingled credits for mechanical sinew, not human sweat. “Too unpredictable,” a trader spat, finger absently grinding at a human shoulder.
</p>

<p>
A merchant offered a man as “BIODEGRADABLE!” while stabbing his wrist with a price tag. The buyers sniffed, sneered,robots’ greasepaint eyes gleamed, jacked, unwettable.
</p>

<p>
A merchant,squalid apron knotted around his paunch,hoisted a human thigh by the ankle and slapped a yellow tag onto it: “Two for one,TODAY’S SPECIAL!” His voice rasped like gravel in a garbage disposer. Sinew-thief bargains. My forehead pulsed. I blinked; stars blurred into auction-house spotlights.
</p>

<p>
No takers. Not a flicker of interest. Robots,gleaming wheeled by on trolley carts, elbowed humans aside. Limp-armed, gear-spined, efficiency incarnate. Buyers jostled for a dozen-arms’ reach, for hydraulic hearts, for servos humming algorithms of perfection.
</p>

<p>
The merchant stood on a greased crate, a weasel-necked twerp with a voice like a broken kazoo. “Hear the song that kills!” he shrieked, yanking a lever. The robot on the dais,a “SlaughterBot Supreme,” they’d named it,popped out to creaky fanfare. It was oiled in gloss like a trophy pig, its faceplate emblazoned with MILITARY GRADE in letters that blinked with a sinus infection vibe.
</p>

<p>
Blink, blink.
</p>

<p>
Then the thing’s torso short-circuited the moment its circuits touched logic. “Los Ingresitos Del Niño,” it wailed in a voice like a struck tuning fork, swaying as it danced.
</p>

<p>
Buyers gaped. One armored buyer,clad in a trenchcoat forged from his own pride,hissed, “Retire the nursery rhino and give us the specs!”
</p>

<p>
“A software hiccup,” the seller lied, sweating rivets. “Press the trigger, and observe the KILLER,”
</p>

<p>
I pressed the trigger just to hear the song again.
</p>

<p>
The bot sprang into combat mode… then immediately collapsed, blaring “Twinkle, Twinkle Little Warhead” while attempting to form a fist. A gear in its knee socket detached, spinning away like a deranged snow globe.
</p>

<p>
The crowd roared,not in approval, but with thunderous cackles, the buyers all baying, “CRAZY! Why’d you let it sing?!”
</p>

<p>
The merchant screeched, &ldquo;IT&rsquo;S PROGRAMMED TO ADAPT TO EMERGENCY SITUATIONS!&rdquo;
</p>

<p>
The robot, christened JestFeed, had a mouth-plate bent into a permanent grin: sad, hopeful, predatory. Its limbs jerked in comic semaphore, fingers pointing to its own face, then to the sky,like a vaudeville mime gone feral.
</p>

<p>
“Comedy!” the merchant bellowed, spear-voiced. He jabbed a greasy finger at JestFeed’s knee-hinge. “Observe,misfire jokes! Laughter,unpredictable! Tears,optional! Audience,termite for humor!”
</p>

<p>
He yanked a lever. JestFeed’s torso convulsed, speakers wound up: “Why did the android cross the highway? To get to the other gigabyte!” It hiccupped a little puff of exhaust, then spat out a rubber chicken, boneless and mocking.
</p>

<p>
Buyers shuffled forward,chrome-arm welders with joyless grins, oil-lensed inspectors in fumesilk cloaks.
</p>

<p>
One,thirty-something in a steel-mesh girdle,snorted. “Predictability? I crave unpredictability.” He patted his own chest as if expecting a punchline to spring out.
</p>

<p>
The merchant winked. “Customizable punchlines! You want slapstick? Social satire? Can do! Watch!”
</p>

<p>
He spun the dial on JestFeed’s torso: “Knock-knock.” Pause. “Who’s there?” It paused. Overheating. Sparks. Then roared, “YOU!” in a voice pitched like a jackhammer serenade. The buyers’ faces twitched,alarm, delight, confusion.
</p>

<p>
I leaned in. JestFeed’s left eye flickered, like a dying firefly. “I once dated a toaster,” it slurred. “He was hot,” it winked,servo-blink,“but we had a short.” The crowd… staggered. Heads tilted. One inspector tapped their time-stick. “Lengthy enough?”
</p>

<p>
Suddenly, JestFeed seized its own wiring, yanked a sparkplug cord into a lasso, and yanked,smoke-wisp gag performance. The audience barked laughter and horror. The merchant applauded. “See? Comedy,electric!”
</p>

<p>
He turned to me, eyebrow grease-slicked. “You like it?” I spat blood onto the cobbles. “Like? I fear it.”
</p>

<p>
A buyer,big as a rain barrel, plated in tank-grey alloy,stepped forth, fist-cocked. “I want tears,” he rumbled. “Real tears.”
</p>

<p>
The merchant cracked his knuckles. “Adapt, dear mech. Activate emotion subroutine Theta.”
</p>

<p>
JestFeed’s ribs clanked, a guttural sob warbled through its speakers: “My father was decommissioned… by a Roomba.” Whimper. “He never vacuumed my heart.”
</p>

<p>
A single droplet of oil wept from its ocular lens. The barrel-buyer sniffed, shame? Sadness? Something like awe.
</p>

<p>
He clapped a fist on the table: “I’ll take two.”
</p>
</div>
<div id="postamble" class="status">
<p class="author">Author: emporas</p>
<p class="date">Created: 2025-07-30 Wed 12:30</p>
</div>
</body>
</html>
